package project;

/*
------------------------- [3학년 필수 구현 부분] -------------------------
    ◻ 본 프로그램의 작성 시 멀티 스레드(3개 이상[e.g : 기본 판매 및 관리자 등])가 적절
한 곳에 1회 이상씩 사용되어야 한다.
    ◻ 관리자 메뉴에서 필요한 관리 데이터는 별도의 데이터베이스를 사용하여야 한다.
    ◻ 본 프로그램에서 작성하는 자판기 관리 프로그램을 통해 생성/저장된 모든 데이터들
은 Socket 프로그래밍을 통해 지정된 서버로 전송되어 관리될 수 있어야 한다. 또한 
상기한 바와 같은 데이터를 수신한 서버는 다음과 같은 기능을 수행할 수 있어야 한다.
      - 각 자판기의 각 음료별 일별/월별 매출현황의 합산/누적합산
      - 각 자판기의 일별/월별 매출 현황의 합산/누적합산
      - 각 자판기의 실시간 재고현황 파악
      - 각 자판기의 음료 재고 부족 시 관리자에게 알림 메시지 전송
      - 각 자판기의 음료 이름 변경
      - 기타
    ◻ 본 프로그램의 동작은 적어도 3대 이상의 PC (Client1, Client2, Server) 혹은 
Socket 프로그래밍을 통해 통신할 수 있는 3가지의 환경에서 동작할 수 있어야 한다.
    ◻ 기타: 명시된 기능들 외에 자신의 프로그램만의 특장점이 될 수 있는 기능들을 추가할 
경우 이를 명시하고 구현할 수 있다
 */

public class Mutli_thread {

}
